irrenhaus/HAL-9000/Software/.coverage/data/stm32f10x_rtc_4611_IUT.c
  ((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->CNTH = CounterValue >> 16;

  ((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->CNTL = (CounterValue & ((uint32_t)0x0000FFFF));
  RTC_ExitConfigMode();

CS_CMM_PROBE_NODE_STMT(159,2,1) 
 CODESCROLL_FUNC_END(283, 19, 155) } CODESCROLL_FUNC_END_RBRACE 






void RTC_SetPrescaler(uint32_t PrescalerValue)
{ CODESCROLL_FUNC_BEGIN(284, (284, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable749,725) 

  
  CS_CMM_PROBE_NODE_STMT(159,1,0) ((void)0);

  RTC_EnterConfigMode();

  ((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->PRLH = (PrescalerValue & ((uint32_t)0x000F0000)) >> 16;

  ((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->PRLL = (PrescalerValue & ((uint32_t)0x0000FFFF));
  RTC_ExitConfigMode();

CS_CMM_PROBE_NODE_STMT(159,0,1) 
 CODESCROLL_FUNC_END(284, 19, 173) } CODESCROLL_FUNC_END_RBRACE 






void RTC_SetAlarm(uint32_t AlarmValue)
{ CODESCROLL_FUNC_BEGIN(285, (285, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable750,726) 
  
  CS_CMM_PROBE_NODE_STMT(160,7,0) RTC_EnterConfigMode();

  ((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->ALRH = AlarmValue >> 16;

  ((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->ALRL = (AlarmValue & ((uint32_t)0x0000FFFF));
  RTC_ExitConfigMode();

CS_CMM_PROBE_NODE_STMT(160,6,1) 
 CODESCROLL_FUNC_END(285, 19, 188) } CODESCROLL_FUNC_END_RBRACE 






uint32_t RTC_GetDivider(void)
{ CODESCROLL_FUNC_BEGIN(286, (286, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable751,727) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable752,160,5,0)

  uint32_t tmp = 0x00;
  tmp = ((uint32_t)((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->DIVH & (uint32_t)0x000F) << 16;
  tmp |= ((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->DIVL;
  
  CS_CMM_PROBE_NODE_STMT(160,4,1) 
   CODESCROLL_FUNC_END(286, 19, 200) return tmp;
} CODESCROLL_FUNC_END_RBRACE 







void RTC_WaitForLastTask(void)
{ CODESCROLL_FUNC_BEGIN(287, (287, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable753,728) 

  
  CS_CMM_PROBE_NODE_STMT(160,3,0) while ( CS_CMM_PROBE_NODE_EXPR(160,2,1) (((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->CRL & ((uint16_t)0x0020)) == (uint16_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable754,729) 
  
  CS_CMM_PROBE_NODE_STMT(160,1,2) } CS_CMM_PROBE_C1(730) CS_CMM_LABEL(cs_cmm_while_end_287_1) 

CS_CMM_PROBE_NODE_STMT(160,0,3) 
 CODESCROLL_FUNC_END(287, 19, 215) } CODESCROLL_FUNC_END_RBRACE 
/* # 225 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rtc.c"*/
void RTC_WaitForSynchro(void)
{ CODESCROLL_FUNC_BEGIN(288, (288, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable755,731) 

  
  CS_CMM_PROBE_NODE_STMT(161,7,0) ((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->CRL &= (uint16_t)~((uint16_t)0x0008);

  while ( CS_CMM_PROBE_NODE_EXPR(161,6,1) (((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->CRL & ((uint16_t)0x0008)) == (uint16_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable756,732) 
  
  CS_CMM_PROBE_NODE_STMT(161,5,2) } CS_CMM_PROBE_C1(733) CS_CMM_LABEL(cs_cmm_while_end_288_1) 

CS_CMM_PROBE_NODE_STMT(161,4,3) 
 CODESCROLL_FUNC_END(288, 19, 233) } CODESCROLL_FUNC_END_RBRACE 
/* # 246 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rtc.c"*/
FlagStatus RTC_GetFlagStatus(uint16_t RTC_FLAG)
{ CODESCROLL_FUNC_BEGIN(289, (289, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable757,734) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable758,161,3,0)

  FlagStatus bitstatus = RESET;


  ((void)0);

  
  CS_CMM_PROBE_NODE_STMT(161,2,1) if ((((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->CRL & RTC_FLAG) != (uint16_t)RESET)
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable759,735) 
    
    CS_CMM_PROBE_NODE_STMT(161,1,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_C1(CodeScrollVariable760,736) 
    
    CS_CMM_PROBE_NODE_STMT(161,0,3) bitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(162,7,4) 
   CODESCROLL_FUNC_END(289, 19, 261) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 275 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rtc.c"*/
void RTC_ClearFlag(uint16_t RTC_FLAG)
{ CODESCROLL_FUNC_BEGIN(290, (290, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable761,737) 

  
  CS_CMM_PROBE_NODE_STMT(162,6,0) ((void)0);


  ((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->CRL &= (uint16_t)~RTC_FLAG;

CS_CMM_PROBE_NODE_STMT(162,5,1) 
 CODESCROLL_FUNC_END(290, 19, 282) } CODESCROLL_FUNC_END_RBRACE 
/* # 293 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rtc.c"*/
ITStatus RTC_GetITStatus(uint16_t RTC_IT)
{ CODESCROLL_FUNC_BEGIN(291, (291, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable762,738) 
  CS_CMM_PROBE_NODE_DECL(CodeScrollVariable763,162,4,0)

  ITStatus bitstatus = RESET;

  ((void)0);

  bitstatus = (ITStatus)(((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->CRL & RTC_IT);
  
  CS_CMM_PROBE_NODE_STMT(162,3,1) if (CS_MCDC_291_0(((((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->CRH & RTC_IT) != (uint16_t)RESET), (bitstatus != (uint16_t)RESET), 42))
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable764,28) 
    
    CS_CMM_PROBE_NODE_STMT(162,2,2) bitstatus = SET;
  }
  else
  { CS_CMM_PROBE_DECL_CX(CodeScrollVariable765,29) 
    
    CS_CMM_PROBE_NODE_STMT(162,1,3) bitstatus = RESET;
  }
  
  CS_CMM_PROBE_NODE_STMT(162,0,4) 
   CODESCROLL_FUNC_END(291, 19, 308) return bitstatus;
} CODESCROLL_FUNC_END_RBRACE 
/* # 320 "C:\\Users\\irrenhaus\\Atollic\\TrueSTUDIO\\STM32_workspace\\Bordcomputer\\firmware\\STM32F10x_StdPeriph_Driver\\src\\stm32f10x_rtc.c"*/
void RTC_ClearITPendingBit(uint16_t RTC_IT)
{ CODESCROLL_FUNC_BEGIN(292, (292, CODESCROLL_BASIS_ADDR, 0)) CODESCROLL_FUNC_END_LBRACE  CS_CMM_PROBE_DECL_C1(CodeScrollVariable766,739) 

  
  CS_CMM_PROBE_NODE_STMT(163,7,0) ((void)0);


  ((RTC_TypeDef *) (((uint32_t)0x40000000) + 0x2800))->CRL &= (uint16_t)~RTC_IT;

CS_CMM_PROBE_NODE_STMT(163,6,1) 
 CODESCROLL_FUNC_END(292, 19, 327) } CODESCROLL_FUNC_END_RBRACE 
